Repository: IBI-s-IT/ibi-lounge-ios
Catalog: *.lproj/Localizable.strings
Languages: ru

# main.title
source: Schedules
ru: Расписание

# main.this_week
source: This week
ru: Текущая неделя

# main.next_week
source: Next week
ru: Следующая неделя

# main.this_month
source: This month
ru: Текущий месяц

# main.next_month
source: Next month
ru: Следующий месяц

# main.custom_range
source: Custom range
ru: Свой период

# main.from
source: From
ru: Начало

# main.to
source: To
ru: Конец

# main.done
source: Done
ru: Готово

# main.today
source: Today
ru: Сегодня

# main.period
source: Period
ru: Период

# schedules.is_online
source: Online
ru: Онлайн

# schedules.consultation
source: Consultation
ru: Консультация

# schedules.exam
source: Exam
ru: Экзамен

# schedules.lecture
source: Lecture
ru: Лекция

# schedules.practice
source: Practice
ru: Практика

# schedules.library_day
source: Library day
ru: Библ. день

# schedules.subject_report
source: Test
ru: Зачёт

# schedules.subject_report_with_grade
source: Graded test
ru: Диф. зачёт

# schedules.project_work
source: Project work
ru: Проект. деят.

# schedules.unknown
source: Unknown
ru: Незвестно

# settings.title
source: Preferences
ru: Параметры

# settings.section.schedule
source: Schedules
ru: Расписание

# settings.education_level
source: Education level
ru: Уровень образования

# settings.group_selection
source: Group
ru: Группа

# undergraduate
source: Undegraduate
ru: Бакалавриат

source: Specialty
ru: Специалитет

source: Magistracy
ru: Магистратура

source: Postgraduate
ru: Аспирантура

# additionals
source: Additional
ru: СПО

# lms.title
source: Materials
ru: ЕЭОС

# grades.title
source: Grades
ru: Оценки

# grades.data
source: Student's data
ru: Данные студента

# grades.pin
source: Student's PIN
ru: PIN студента

# grades.lastName
source: Last name
ru: Фамилия студента

# grades.submit
source: Submit
ru: Получить

# grades.grades
source: Student's grades
ru: Оценки студента

source: Subject report with grade
ru: Дифференцированный зачёт

source: Subject report
ru: Зачёт

source: Online course work
ru: Курсовая работа (заочно)

source: Offline course work
ru: Курсовая работа (очно)

source: Exam
ru: Экзамен

source: Passed
ru: Зачтено

source: Absence
ru: Не явка

source: Failed
ru: Не зачтено

source: Not admitted
ru: Не допущен

# error.network_error
source: No network
ru: Нет подключения к интернету

# error.network_error.desc
source: Connect to the internet
ru: Подключитесь к сети

# error.unknown_error
source: Something bad happened
ru: Что-то пошло не так

# error.unknown_error.desc
source: Try again later
ru: Попробуйте снова позднее

# error.no_schedules
source: No courses for selected period
ru: Пар нет

# error.no_schedules.desc
source: Try to change period
ru: Попробуйте поменять период

# error.enter_data
source: Enter data
ru: Введите данные

# error.enter_data.desc
source: And then try again...
ru: А затем попробуйте снова...

source: Error code: %@
ru: Код ошибки: %@

# error.no_grades
source: Grades not found
ru: Оценки не найдены

# error.no_grades.desc
source: Check your «PIN» and «Last name» in settings
ru: Может их ещё не выставили, а может вы неверно ввели в настрйках свои данные

# error.no_groups
source: Groups not found
ru: Группы не найдены

# error.no_groups.desc
source: Select your education level in settings and then select your group
ru: Укажите уровень образования в настройках а затем выберите группу

# error.no_education_level_specified
source: Specify your education level
ru: Уровень образования не указан

# error.no_education_level_specified.desc
source: And then try again...
ru: Укажите свой уровень образования в настройках

# error.try_again
source: Try again
ru: Повторить попытку

# error.timed_out
source: Request timed out
ru: Превышен лимит времени на запрос

# error.timed_out.desc
source: Check your network connection and try again
ru: Проверьте подключение сети и попробуйте снова

# valid.pin_length
source: PIN must be 5 characters long
ru: ПИН содержит 5 цифр

# valid.pin_empty
source: Enter PIN
ru: Введите ПИН

# valid.last_name_length
source: Last name must be atleast 3 characters long
ru: Фамилия должна содержать минимум 3 символа

# valid.last_name_empty
source: Enter last name
ru: Введите фамилию

# widget.no_schedules
source: Well done
ru: Умница

# widget.no_schedules.desc
source: Have a rest!
ru: (сущ.) ты

# widget.left %@
source: %@ more classes...
ru: ещё %@...

# widget.name
source: Classes today and tomorrow
ru: Пары на сегодня и завтра

# widget.description
source: See your current classes directly from the Home Screen
ru: Смотрите свои текущие пары прямо с экрана "Домой"

# onboarding.welcome1
source: Welcome to
ru: Добро пожаловать в

# onboarding.item1.title
source: All in one for IBI
ru: Всё в одном для МБИ

# onboarding.item1.subtitle
source: Here are the courses, the schedule and your grades
ru: Здесь есть и ЕЭОС и расписание и ваши оценки

# onboarding.item2.title
source: Schedule widget
ru: Виджет расписания

# onboarding.item2.subtitle
source: Displays the remaining activities for today and tomorrow on the Home screen
ru: Отобразит непройденные пары на сегодня и на завтра на экране Домой

# onboarding.item3.title
source: Grades
ru: Оценки

# onboarding.item3.subtitle
source: Quick access to grades from the app
ru: Быстрый доступ к оценкам из приложения

# onboarding.disclaimer1
source: Important! This application is intended for Internation Banking Institute named after Anatoliy Sobchak
ru: Важно! Это приложение предназначено для АНО ВО МБИ им. Анатолия Собчака

# onboarding.disclaimer2
source: You can change these settings later
ru: Вы сможете позже изменить эти настройки

# onboarding.proceed1
source: Set me up
ru: Настроить

# onboarding.proceed2
source: Done
ru: Приступим

# onboarding.schedules.footnote
source: This data will be needed to display your schedule
ru: Эти данные понадобятся для отображения вашего расписания

# onboarding.grades.footnote
source: This data will be needed to display your grades
ru: Эти данные понадобятся для отображения ваших оценок

# transfer.title %@
source: 📅 Schedule for %@
ru: 📅 Расписание на %@

# materials.title
source: Materials
ru: Материалы

# materials.lms
source: Learning management system
ru: ЕЭОС

# materials.news
source: News
ru: Новости

# materials.employees
source: Teaching staff
ru: Педагогический состав

# materials.contacts
source: Contacts
ru: Контакты
